package javaPrj;

import java.util.ArrayList;
import java.util.Arrays;

public class 독서실좌석 {

	public static void  main(String[] args) {
		ArrayList<독서실클래스1> 좌석도면 = new ArrayList<>();
		

		좌석도면.add(new 독서실클래스1("┌", "──────", "─", "─", "─", "─", "─", "─", "─", "┐"));
		좌석도면.add(new 독서실클래스1("│", "", "01□ ", "02□ ", "03□ ", "04□ ", "05□ ", "", "", "│"));
		좌석도면.add(new 독서실클래스1("│", " ", "□ ", "□ ", "□ ", "□ ", "□ ", " ", " ", "│"));
		좌석도면.add(new 독서실클래스1("│", " ", "  ", "  ", "  ", "  ", "  ", " ", " ", "│"));
		좌석도면.add(new 독서실클래스1("│", " ", "□ ", "□ ", "□ ", "□ ", "□ ", " ", " ", "│"));
		좌석도면.add(new 독서실클래스1("│", " ", "□ ", "□ ", "□ ", "□ ", "□ ", " ", " ", "│"));
		좌석도면.add(new 독서실클래스1("│", " ", "  ", "  ", "  ", "  ", "  ", " ", " ", "┴ "));
		좌석도면.add(new 독서실클래스1("│", " ", "□ ", "□ ", "□ ", "□ ", "□ ", " ", " ", "┬"));
		좌석도면.add(new 독서실클래스1("└", "──────", "─", "─", "─", "─", "─", "─", "─", "┘"));
		
		for (int i = 0; i < 좌석도면.size(); i++) {
			독서실클래스1 score = 좌석도면.get(i);
			System.out.println(score);
	}

	}

}
